Repository: vipinchan/mimi-remote
Catalog: ios/MimiRemote/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# ui.current_ssh_app_server_does_not_support_experimental_api
source: The current SSH App Server does not support the experimental API %@. The message was not sent.
zh_hans: 当前 SSH App Server 不支持实验接口 %@，消息未发送。

# ui.current_value
source: Current: %@
zh_hans: 当前：%@

# ui.current_value_value
source: Current: %@ · %@
zh_hans: 当前：%@ · %@

# ui.currently_accessible_from_the_conversation_sidebar
source: Currently accessible from the conversation sidebar
zh_hans: 当前可从会话侧栏进入

# ui.currently_agentd_or_codex_app_server_does_not
source: Currently agentd or Codex app-server does not support thread/search
zh_hans: 当前 agentd 或 Codex app-server 不支持 thread/search

# ui.currently_showing_abbreviated_history
source: Currently showing compact history.
zh_hans: 当前显示缩略历史。

# ui.currently_value
source: Currently%@…
zh_hans: 正在%@…

# ui.custom_emoji
source: Custom Emoji
zh_hans: 自定义 Emoji

# ui.custom_goal
source: custom goal
zh_hans: 自定义目标

# ui.cwd_must_be_from_project_allowlist
source: cwd must be from project allowlist
zh_hans: cwd 必须来自项目 allowlist

# ui.dark
source: Dark
zh_hans: 深色

# ui.dark_and_light_colors
source: Dark and light colors
zh_hans: 深浅色

# ui.days_ago_value
source: %@ d ago
zh_hans: %@ 天前

# ui.days_count
source: %lld days
zh_hans: %lld 天

# ui.days_unused_count
source: Unused for more than %lld days
zh_hans: 超过 %lld 天未使用

# ui.deactivated
source: Deactivated
zh_hans: 已停用

# ui.debug_enter_the_workbench
source: Debug enter the workbench
zh_hans: Debug 进入工作台

# ui.debug_image_generation_skill_description
source: Create product concepts, illustrations, and bitmap assets
zh_hans: 创建产品概念图、插图与位图素材

# ui.debug_ios_debugger_skill_description
source: Build, run, and diagnose UI issues on devices or simulators
zh_hans: 在真机或模拟器上构建、运行并诊断界面问题

# ui.debug_session_value_selected
source: Debug session selected %@
zh_hans: 已选择 Debug 会话 %@

# ui.debug_swiftui_patterns_skill_description
source: Stable data flow, component layouts, and native interactions
zh_hans: 稳定的数据流、组件布局与原生交互

# ui.debug_ui_sample_expanded_value
source: Debug UI sample expanded %@
zh_hans: Debug UI 样例已展开 %@

# ui.debug_ui_sample_loaded
source: Debug UI sample loaded
zh_hans: Debug UI 样例已加载

# ui.debug_ui_sample_will_not_connect_to_the
source: Debug UI sample will not connect to the backend
zh_hans: Debug UI 样例不会连接后端

# ui.debug_workspace_value_selected
source: Debug workspace %@ selected
zh_hans: 已选择 Debug 工作区 %@

# ui.decision_sent
source: decision sent
zh_hans: 决定已发送

# ui.default_model
source: Default model
zh_hans: 默认模型

# ui.default_model_settings_description
source: Choose what new conversations use when they do not have a saved model selection.
zh_hans: 配置没有保存模型选择时，新会话使用的模型和推理强度。

# ui.default_off
source: Off by default
zh_hans: 默认关闭

# ui.default_option
source: Default
zh_hans: 默认

# ui.default_permissions
source: Default permissions
zh_hans: 默认权限

# ui.default_permissions_for_new_conversations
source: Default permissions for new conversations
zh_hans: 新对话默认权限

# ui.default_run_permissions_for_new_input_areas_and
source: Default run permissions for new conversations. Existing threads keep their current permissions until you explicitly change them in the input area.
zh_hans: 用于新对话的默认运行权限。已有会话会沿用当前权限，直到你在输入区中明确修改。

# ui.default_value
source: Default · %@
zh_hans: 默认 · %@

# ui.delete
source: Delete
zh_hans: 删除

# ui.delete_attachment
source: Delete attachment
zh_hans: 删除附件

# ui.delete_connection_file
source: Delete connection profile
zh_hans: 删除连接档案

# ui.delete_git_worktree
source: Delete Git Worktree?
zh_hans: 删除 Git Worktree？

# ui.delete_selected_value_worktrees
source: Delete selected %@ Worktrees
zh_hans: 删除选中的 %@ 个 Worktree

# ui.delete_value
source: Delete %@
zh_hans: 删除 %@

# ui.delete_value_c193903e
source: Delete “%@”?
zh_hans: 删除“%@”？

# ui.deleted
source: Deleted
zh_hans: 已删除

# ui.deletions_will_still_be_checked_by_agentd_against
source: Deletions will still be checked by agentd against running sessions and Git status; protection will not be forced to be bypassed if uncommitted changes exist.
zh_hans: 删除仍会由 agentd 检查运行中会话和 Git 状态；存在未提交改动时不会强制绕过保护。

# ui.deny_approval
source: Deny approval
zh_hans: 拒绝审批

# ui.deny_is_always_available
source: Deny is always available
zh_hans: 拒绝始终可用

# ui.describe_the_issues_to_plan_for_first
source: Describe the issues to plan for first
zh_hans: 描述要先规划的问题

# ui.describe_the_target_task
source: Describe the Goal
zh_hans: 描述目标

# ui.developer_mode
source: Developer mode
zh_hans: 开发者模式

# ui.diagnosis
source: Diagnosis
zh_hans: 诊断

# ui.diagnosis_and_support
source: Diagnosis and Support
zh_hans: 诊断与支持

# ui.diagnosis_result_is_not_utf_8
source: Diagnosis result is not UTF-8
zh_hans: 诊断结果不是 UTF-8

# ui.diagnostic_request_failed
source: Diagnostic request failed
zh_hans: 诊断请求失败

# ui.diagnostic_request_failed_http_value_please_check_mac
source: Diagnostic request failed (HTTP %@), please check Mimi Mac Assistant status and try again.
zh_hans: 诊断请求失败（HTTP %@），请检查 Mimi Mac 助手状态后重试。

# ui.diagnostic_request_failed_http_value_value
source: Diagnostic request failed (HTTP %@): %@
zh_hans: 诊断请求失败（HTTP %@）：%@

# ui.diagnostics_have_not_been_run_yet
source: Diagnostics have not been run yet
zh_hans: 尚未运行诊断

# ui.diff_not_staged
source: diff not staged
zh_hans: 未暂存 diff

# ui.diff_staged
source: diff staged
zh_hans: 已暂存 diff

# ui.diff_statistics
source: Diff Statistics
zh_hans: Diff 统计

# ui.direct_connection_to_this_machine
source: Direct connection to this machine
zh_hans: 本机直连

# ui.direct_current_reply_now
source: Steer current response now
zh_hans: 立即引导当前回复

# ui.direct_mode_must_first_select_the_allowlist_item
source: Direct mode must first select the allowlist item
zh_hans: direct 模式必须先选择 allowlist 项目

# ui.direct_websocket_not_connected
source: direct WebSocket not connected
zh_hans: direct WebSocket 未连接

# ui.directed_current_reply_immediately
source: Response steered immediately
zh_hans: 已立即引导当前回复

# ui.directly_connected_through_local_assistant
source: Directly connected through Mimi Mac Assistant.
zh_hans: 已通过本机助手直连

# ui.directory
source: Directory
zh_hans: 目录

# ui.directory_not_yet_opened
source: Directory not yet opened
zh_hans: 还没有打开的目录

# ui.directory_value
source: Directory: %@
zh_hans: 目录：%@

# ui.discover_issues_that_need_to_be_addressed
source: Discover issues that need to be addressed
zh_hans: 发现需要处理的问题

# ui.display_name
source: display name
zh_hans: 显示名称

# ui.do_not_write_files_by_default
source: Do not write files by default
zh_hans: 默认不写文件

# ui.docs_update_project_documentation
source: docs: Update project documentation
zh_hans: docs: 更新项目文档

# ui.doctor_access_token_needs_attention
source: Access token needs attention.
zh_hans: 访问令牌需要处理。

# ui.doctor_access_token_ready
source: Access token is configured.
zh_hans: 访问令牌已配置。

# ui.doctor_check_failed
source: Check failed.
zh_hans: 检查失败。

# ui.doctor_check_passed
source: Check passed.
zh_hans: 检查通过。

# ui.doctor_check_warning
source: Check needs attention.
zh_hans: 检查需要关注。

# ui.doctor_claude_bridge_needs_attention
source: Claude bridge needs attention.
zh_hans: Claude bridge 需要处理。

# ui.doctor_claude_bridge_ready
source: Claude bridge check passed.
zh_hans: Claude bridge 检查通过。

# ui.doctor_codex_app_server_needs_attention
source: Codex app-server needs attention.
zh_hans: Codex app-server 需要处理。

# ui.doctor_codex_app_server_ready
source: Codex app-server check passed.
zh_hans: Codex app-server 检查通过。

# ui.doctor_codex_cli_needs_attention
source: Codex CLI needs attention.
zh_hans: Codex CLI 需要处理。

# ui.doctor_codex_cli_ready
source: Codex CLI check passed.
zh_hans: Codex CLI 检查通过。

# ui.doctor_fix_claude_bridge
source: Install or configure alleycat-claude-bridge, then try again.
zh_hans: 安装或配置 alleycat-claude-bridge 后重试。

# ui.doctor_fix_codex
source: Install Codex CLI and make sure codex is on PATH.
zh_hans: 安装 Codex CLI，并确保 codex 位于 PATH 中。

# ui.doctor_fix_codex_app_server
source: Upgrade Codex CLI, then run agentd doctor again.
zh_hans: 升级 Codex CLI，然后重新运行 agentd doctor。

# ui.doctor_fix_gateway
source: Run agentd setup to restore the loopback app-server upstream.
zh_hans: 运行 agentd setup 恢复 loopback app-server 上游。

# ui.doctor_fix_generic
source: Review this check on your Mac, then run agentd doctor again.
zh_hans: 请在 Mac 上检查此项，然后重新运行 agentd doctor。

# ui.doctor_fix_port
source: Review the listening address and stop the process using the port.
zh_hans: 检查监听地址，并停止占用该端口的进程。

# ui.doctor_fix_projects
source: Configure at least one project for agentd.
zh_hans: 请为 agentd 配置至少一个项目。

# ui.doctor_fix_runtime
source: Set runtime.type to codex_app_server, then run agentd setup again.
zh_hans: 将 runtime.type 设为 codex_app_server，然后重新运行 agentd setup。

# ui.doctor_fix_sensitive_file
source: Run agentd doctor --fix, then review file ownership and permissions.
zh_hans: 运行 agentd doctor --fix，然后检查文件所有者和权限。

# ui.doctor_fix_tailscale
source: Install and sign in to Tailscale.
zh_hans: 安装并登录 Tailscale。

# ui.doctor_fix_token
source: Run agentd setup to create an access token.
zh_hans: 运行 agentd setup 创建访问令牌。

# ui.doctor_gateway_needs_attention
source: app-server gateway needs attention.
zh_hans: app-server 网关需要处理。

# ui.doctor_gateway_ready
source: app-server gateway check passed.
zh_hans: app-server 网关检查通过。

# ui.doctor_port_needs_attention
source: Port needs attention.
zh_hans: 端口需要处理。

# ui.doctor_port_ready
source: Port check passed.
zh_hans: 端口检查通过。

# ui.doctor_projects_needs_attention
source: Project configuration needs attention.
zh_hans: 项目配置需要处理。

# ui.doctor_projects_ready
source: Project configuration is available.
zh_hans: 项目配置可用。

# ui.doctor_raw_fix
source: Suggested fix
zh_hans: 建议修复方式

# ui.doctor_raw_json
source: Doctor raw JSON
zh_hans: Doctor 原始 JSON

# ui.doctor_raw_message
source: Message
zh_hans: 消息

# ui.doctor_runtime_needs_attention
source: Runtime configuration needs attention.
zh_hans: 运行时配置需要处理。

# ui.doctor_runtime_ready
source: Runtime configuration check passed.
zh_hans: 运行时配置检查通过。

# ui.doctor_sensitive_file_needs_attention
source: Sensitive file needs attention.
zh_hans: 敏感文件需要处理。

# ui.doctor_sensitive_file_ready
source: Sensitive file check passed.
zh_hans: 敏感文件检查通过。

# ui.doctor_tailscale_needs_attention
source: Tailscale needs attention.
zh_hans: Tailscale 需要处理。

# ui.doctor_tailscale_ready
source: Tailscale check passed.
zh_hans: Tailscale 检查通过。

# ui.document_verification_has_been_completed_the_installation_command
source: Document verification has been completed: the installation command is executable, and the architecture is consistent with the current runtime selection logic.
zh_hans: 已完成文档核对：安装命令可执行，架构与当前 runtime 选择逻辑一致。

# ui.dosage_limited
source: Usage limit reached
zh_hans: 用量受限

# ui.duplicate_json_rpc_request_id_value
source: JSON-RPC request id duplicate: %@
zh_hans: JSON-RPC request id 重复：%@

# ui.duplicate_session
source: Duplicate session
zh_hans: 复制会话

# ui.duplicate_session_failed_value
source: Couldn’t duplicate session: %@
zh_hans: 复制会话失败：%@

# ui.dynamic_tools
source: dynamic tools
zh_hans: 动态工具

# ui.each_project_retains_at_least
source: Each project retains at least
zh_hans: 每个项目至少保留

# ui.each_session_retains_a_maximum_of_value_messages
source: Each session retains at most %@ messages to be sent, please process the existing queue first
zh_hans: 每个会话最多保留 %@ 条待发送消息，请先处理现有队列

# ui.earlier
source: Earlier
zh_hans: 更早

# ui.edit
source: Edit
zh_hans: 编辑

# ui.edit_message_to_send
source: Edit message to send
zh_hans: 编辑待发送消息

# ui.edit_target
source: Edit Goal
zh_hans: 编辑目标

# ui.editing_only_affects_the_local_content_to_be
source: Editing only affects the local content to be sent; after saving, it will still be sent in the original queue order.
zh_hans: 编辑只影响本机待发送内容；保存后仍按原队列顺序发送。

# ui.emoji_already_used
source: Another workspace already uses this Emoji.
zh_hans: 另一个工作区已经使用了这个 Emoji。

# ui.enable_on_mac
source: Enable on Mac
zh_hans: 在 Mac 上开启

# ui.end_voice_input
source: End voice input
zh_hans: 结束语音输入

# ui.ended
source: ended
zh_hans: 已结束

# ui.english
source: English
zh_hans: 英文

# ui.enter_access_code
source: Enter access code
zh_hans: 输入访问码

# ui.enter_name
source: Enter name
zh_hans: 输入名称

# ui.enter_one_emoji
source: Enter one Emoji
zh_hans: 输入一个 Emoji

# ui.enter_one_valid_emoji
source: Enter one valid Emoji.
zh_hans: 请输入一个有效的 Emoji

# ui.enter_path_manually
source: Enter path manually
zh_hans: 手动输入路径

# ui.enter_tasks_or_follow_up_instructions
source: Enter tasks or follow-up instructions
zh_hans: 输入任务或后续指令

# ui.enter_text
source: Enter text
zh_hans: 输入文本

# ui.enter_value
source: Output %@
zh_hans: 输出 %@

# ui.enter_your_tasks_below_and_mimi_remote_retains
source: Enter your tasks below and Mimi Remote retains your current workspace and session context.
zh_hans: 在下方输入任务，Mimi Remote 会保留当前工作区与会话上下文。

# ui.entrance
source: entrance
zh_hans: 入口

# ui.entry
source: entry
zh_hans: 条目

# ui.environment
source: environment
zh_hans: 环境

# ui.error
source: Error
zh_hans: 错误

# ui.error_value
source: Error: %@
zh_hans: 错误：%@

# ui.evaluating_cleanup_candidates
source: Evaluating cleanup candidates
zh_hans: 正在评估清理候选

# ui.example_studio_mac
source: Example: Studio computer
zh_hans: 例如：工作室电脑

# ui.execute_a_configured_and_preflighted_local_testflight_publishing
source: Execute a configured and preflighted local TestFlight publishing process on the host
zh_hans: 在主机执行已配置并通过预检的本地 TestFlight 发布流程

# ui.execute_value
source: Execute %@
zh_hans: 执行 %@

# ui.exit_code_value
source: Exit code %@
zh_hans: 退出码 %@

# ui.exit_code_value_3dde4ee9
source: Exit code: %@
zh_hans: 退出码：%@

# ui.expand_current_process_details
source: Expand current process details
zh_hans: 展开当前过程详情

# ui.expand_input_box
source: Expand input field
zh_hans: 展开输入框

# ui.expand_shortcut_button
source: Expand shortcut button
zh_hans: 展开快捷按钮

# ui.expand_this_stage_of_activities
source: Expand this stage of activities
zh_hans: 展开本阶段活动

# ui.expanded
source: Expanded
zh_hans: 已展开

# ui.expanded_state
source: expanded state
zh_hans: 展开状态

# ui.expected_value_recovery_you_can_also_click_increase
source: It is expected that %@ will be restored; you can also click "Increase Quota" or "Reset Usage" on the desktop Codex.
zh_hans: 预计 %@ 恢复；也可以在桌面 Codex 点“增加额度”或“重置使用量”。

# ui.expected_value_reset
source: Expected %@ to reset
zh_hans: 预计 %@ 重置

# ui.experimental_features
source: Experimental Features
zh_hans: 实验功能

# ui.explain_the_failure_log_and_provide_repair_solutions
source: Explain the failure log and provide repair solutions
zh_hans: 解释失败日志并给修复方案

# ui.exploring_value_items
source: Exploring %@ items
zh_hans: 正在探索 %@ 项

# ui.export_current_session_log
source: Export current session log
zh_hans: 导出当前会话日志

# ui.export_log
source: Export log
zh_hans: 导出日志

# ui.export_utf_8_logs_in_the_current_memory
source: Export UTF-8 logs in the current memory cache window
zh_hans: 导出当前内存缓存窗口中的 UTF-8 日志

# ui.extremely_high
source: extremely high
zh_hans: 极高

# ui.failed_349c9e63
source: failed
zh_hans: 未通过

# ui.failed_link_value_value
source: Failed stage: %@ · %@
zh_hans: 失败阶段：%@ · %@

# ui.failed_status
source: Failed
zh_hans: 失败

# ui.failed_to_connect_to_queue_to_be_sent
source: Failed to connect to queue to be sent: %@
zh_hans: 待发送队列连接失败：%@

# ui.failed_to_delete_token_value
source: Failed to delete Token: %@
zh_hans: 删除 Token 失败：%@

# ui.failed_to_guide_conversation_there_is_no_active
source: Failed to steer response: There is no active turn in this session.
zh_hans: 引导对话失败：当前会话没有活跃 turn

# ui.failed_to_load_historical_diagnostics
source: Failed to load historical diagnostics
zh_hans: 历史诊断加载失败

# ui.failed_to_load_historical_images
source: Failed to load historical images
zh_hans: 历史图片加载失败

# ui.failed_to_open_camera_value
source: Failed to open camera: %@
zh_hans: 打开相机失败：%@

# ui.failed_to_parse_response_value
source: Failed to parse response: %@
zh_hans: 解析响应失败：%@

# ui.failed_to_read_the_project_license_file_please
source: Failed to read the project license file. Please view LICENSE via the project GitHub repository.
zh_hans: 项目许可文件读取失败。请通过项目 GitHub 仓库查看 LICENSE。

# ui.failed_to_read_third_party_license_file_please
source: Failed to read third-party license file. Please view THIRD_PARTY_NOTICES.md via the project GitHub repository.
zh_hans: 第三方许可文件读取失败。请通过项目 GitHub 仓库查看 THIRD_PARTY_NOTICES.md。

# ui.failed_to_read_token_value
source: Failed to read Token: %@
zh_hans: 读取 Token 失败：%@

# ui.failed_to_save_local_queue_value
source: Failed to save local queue: %@
zh_hans: 保存本地队列失败：%@

# ui.failed_to_save_token_value
source: Failed to save Token: %@
zh_hans: 保存 Token 失败：%@

# ui.failed_to_send_control_command_value
source: Failed to send control command: %@
zh_hans: 控制指令发送失败：%@

# ui.failed_to_send_supplementary_information_value
source: Failed to send supplementary information: %@
zh_hans: 补充信息发送失败：%@

# ui.failed_to_stop_current_reply_websocket_not_connected
source: Couldn’t stop the current response because the connection is unavailable.
zh_hans: 无法停止当前回复：实时连接不可用。

# ui.failure_link
source: failure link
zh_hans: 失败环节

# ui.failure_value
source: Failure · %@
zh_hans: 失败 · %@

# ui.fast
source: fast
zh_hans: 快速

# ui.favorites_plus_current_session_count
source: %lld favorites plus current session
zh_hans: %lld 个常用 + 当前会话

# ui.file
source: File
zh_hans: 文件

# ui.file_cannot_be_empty
source: The file cannot be empty.
zh_hans: 文件不能为空。

# ui.file_cannot_exceed_20_mib
source: A file cannot exceed 20 MiB.
zh_hans: 单个文件不能超过 20 MiB。

# ui.file_changes
source: File changes
zh_hans: 文件变更

# ui.file_changes_766e4292
source: File changes:
zh_hans: 文件变更：

# ui.file_changes_value
source: File changes: %@
zh_hans: 文件变更：%@

# ui.file_changes_value_value
source: File changes: %@ %@
zh_hans: 文件变更：%@ %@

# ui.file_changes_x_value
source: File changes x%@
zh_hans: 文件变更 x%@

# ui.file_could_not_be_read
source: The selected file could not be read.
zh_hans: 无法读取所选文件。

# ui.file_preview_content_is_invalid
source: File preview content is invalid
zh_hans: 文件预览内容无效

# ui.file_upload_capability_negotiation_failed
source: File upload availability could not be verified for the current Mac. Reconnect, then try again.
zh_hans: 无法确认当前 Mac 的文件上传能力，请重新连接后再试。

# ui.file_upload_dependency_unavailable_on_current_mac
source: File uploads are temporarily unavailable on the current Mac. Run agentd doctor on that Mac for details.
zh_hans: 当前 Mac 的文件上传依赖暂不可用，请在该 Mac 运行 agentd doctor 查看详情。

# ui.file_upload_disabled_on_current_mac
source: File uploads are disabled in the current Mac's local agentd configuration.
zh_hans: 当前 Mac 已在本地 agentd 配置中禁用文件上传。

# ui.file_upload_failed
source: File upload failed
zh_hans: 文件上传失败

# ui.file_upload_host_changed_select_again
source: The active Mac changed. Select the file again for the current Mac.
zh_hans: 当前 Mac 已切换，请为当前 Mac 重新选择文件。

# ui.files_changed_count
source: %lld files changed
zh_hans: %lld 个文件已更改

# ui.files_modified_count
source: Modify %lld files
zh_hans: 修改 %lld 个文件

# ui.files_staged_count
source: Stage %lld files
zh_hans: 暂存 %lld 个文件

# ui.files_to_commit_count
source: %lld files to commit
zh_hans: %lld 个文件待提交

# ui.filter
source: Filter
zh_hans: 筛选

# ui.filter_sessions
source: Filter sessions
zh_hans: 筛选会话

# ui.finalizing_apple_voice_input
source: Finalizing Apple transcription
zh_hans: 正在完成 Apple 转写

# ui.find_page_content
source: Find page content
zh_hans: 查找页面内容

# ui.first_open_a_project_directory_on_your_mac
source: First open a project directory on your Mac and then create a session.
zh_hans: 先打开一个 Mac 上的项目目录，再创建会话。

# ui.first_time_installation
source: First time installation
zh_hans: 首次安装

# ui.follow_system
source: System Default
zh_hans: 跟随系统

# ui.follow_the_current_device_appearance
source: Follow the current device appearance
zh_hans: 跟随当前设备外观

# ui.font
source: font
zh_hans: 字体

# ui.font_size
source: font size
zh_hans: 字体大小

# ui.for_example_main
source: For example main
zh_hans: 例如 main

# ui.forget
source: forget
zh_hans: 忘记

# ui.forget_this_mac
source: Forget this computer
zh_hans: 忘记这台电脑

# ui.forgot_your_current_mac
source: Forget your current computer?
zh_hans: 忘记当前电脑？

# ui.fork_source
source: Fork source
zh_hans: Fork 来源

# ui.forked_to_new_worktree
source: Forked to new Worktree
zh_hans: 已 fork 到新 Worktree

# ui.found
source: Found
zh_hans: 已发现

# ui.free
source: free
zh_hans: 空闲

# ui.full_access
source: Full File Access
zh_hans: 完全文件访问

# ui.full_history_exceeds_limit_retrying_value
source: Full history is about %@, exceeding the %@ limit. Retrying full history with a smaller page.
zh_hans: 完整历史约 %@，超过 %@ 上限；正在按更小分页重试完整历史。

# ui.full_history_exceeds_limit_running_value
source: Full history is about %@, exceeding the %@ limit. It will be restored when the current turn finishes.
zh_hans: 完整历史约 %@，超过 %@ 上限；任务完成后会自动恢复完整历史。

# ui.full_history_exceeds_limit_value
source: Full history is about %@, exceeding the %@ limit. Switching to compact history.
zh_hans: 完整历史约 %@，超过 %@ 上限；正在切换缩略历史。

# ui.full_history_loaded
source: Full history loaded
zh_hans: 已加载完整历史

# ui.full_history_loading_failed_value
source: Full history loading failed: %@
zh_hans: 完整历史加载失败：%@

# ui.gateway_configuration
source: Gateway configuration
zh_hans: Gateway 配置

# ui.gateway_diagnostics
source: Gateway diagnostics
zh_hans: Gateway 诊断

# ui.gateway_judgment
source: Gateway judgment
zh_hans: Gateway 判断

# ui.gateway_observation
source: Gateway Observation
zh_hans: Gateway 观测

# ui.generate
source: generate
zh_hans: 生成

# ui.generate_pictures
source: Generate pictures
zh_hans: 生成图片

# ui.generate_plan
source: Generate plan
zh_hans: 生成计划

# ui.generated_image
source: generated image
zh_hans: 生成的图片

# ui.generation_time_value
source: Generated time: %@
zh_hans: 生成时间：%@

# ui.get_started_with_the_claude_code_runtime
source: Start using the configured optional runtime
zh_hans: 使用已配置的可选运行时开始

# ui.git_action_failed
source: Git action failed
zh_hans: Git 动作失败

# ui.git_branch_diverged
source: Diverged
zh_hans: 已分叉

# ui.git_change_panel
source: Git change panel
zh_hans: Git 变更面板

# ui.git_changes
source: Git changes
zh_hans: Git 变更

# ui.git_changes_count_value
source: %@ changes
zh_hans: %@ 个改动

# ui.git_status
source: Git status
zh_hans: Git 状态

# ui.git_status_is_unavailable
source: Git status is unavailable
zh_hans: Git 状态不可用

# ui.git_status_unknown
source: Git status unknown
zh_hans: Git 状态未知

# ui.git_status_value
source: Git status · %@
zh_hans: Git 状态 · %@

# ui.git_synced
source: Synced
zh_hans: 已同步

# ui.git_worktree
source: Git worktree
zh_hans: Git 工作树

# ui.git_worktree_cleanup_partial_success
source: %@; cleanup failed in other projects.
zh_hans: %@；其他项目清理失败。

# ui.git_worktree_value_has_been_deleted
source: Deleted Git Worktree %@
zh_hans: 已删除 Git Worktree %@

# ui.git_worktree_value_has_been_deleted_but_the
source: Git Worktree %@ has been deleted, but the management registration still needs to be cleaned up
zh_hans: 已删除 Git Worktree %@，但管理登记仍需清理

# ui.git_worktree_was_deleted_but_cleanup_management_registration
source: Git Worktree was deleted but failed to clean up the admin registry: %@. You can try again later using "Clear Lost Registrations".
zh_hans: Git Worktree 已删除，但清理管理登记失败：%@。可稍后使用“清理丢失登记”重试。

# ui.git_worktrees_cleaned_count
source: %lld Git worktrees cleaned
zh_hans: 已清理 %lld 个 Git Worktree

# ui.github_release_accessibility_hint
source: Opens the public GitHub release page in the GitHub app or your default browser.
zh_hans: 在 GitHub App 或默认浏览器中打开公开的 GitHub Release 页面。

# ui.go_to_system_settings
source: Go to system settings
zh_hans: 前往系统设置

# ui.go_to_the_new_git_worktree
source: Go to the new Git Worktree
zh_hans: 转到新 Git Worktree

# ui.go_to_work_area
source: Go to Workspace
zh_hans: 前往工作区

# ui.goal_updated
source: Goal updated
zh_hans: 目标已更新

# ui.got_it
source: Got it
zh_hans: 知道了

# ui.guide
source: Steer
zh_hans: 引导
